# 1. Missing Value

Sering kali, data rusak, atau hilang, kita perlu mengurusnya terlebih dahulu karena kedepannya data ini tidak berfungsi saat data hilang atau tidak lengkap.

### 1.1 Imputing missing values dengan Imputer

In [1]:
import pandas as pd
from sklearn.preprocessing import Imputer

In [3]:
df = pd.read_csv('Data.csv')
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [7]:
df.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

Cek Data Null pada DataFrame

In [4]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

Hilangkan Data Kosong

In [5]:
df.dropna()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
# Drop Kolom yang spesifik yang mengandung NaN
df.dropna(subset=['Age'])

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [8]:
df.iloc[:, 1:3]
#ambil semua data, index 1 sampe 3

    Age   Salary
0  44.0  72000.0
1  27.0  48000.0
2  30.0  54000.0
3  38.0  61000.0
4  40.0      NaN
5  35.0  58000.0
6   NaN  52000.0
7  48.0  79000.0
8  50.0  83000.0
9  37.0  67000.0

Mengganti Nilai NaN, menjadi dat yang terisi

In [9]:
# replace every occurrence of missing_values to one defined by strategy

# which can be mean, median, mode. Axis = 0 means rows, 1 means column

# Imputer ( Missing Values-nya, Strateginya apa, Axisnya 0 berarti baris 1 berarti kolom )

imputer = Imputer(missing_values='NaN', strategy='mean', axis = 0)
# Fit_transform, Method preprocessing 
df.iloc[:, 1:3] = imputer.fit_transform(df.iloc[:, 1:3])
df

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

# 2. Encoding Data Kategori

In [10]:
# Label Encoder will replace every categorical variable with number. Useful for replacing yes by 1, no by 0.

# One Hot Encoder will create a separate column for every variable and give a value of 1 where the variable is present
# Merubah data dari No dan Yes
# Menggunakan Label Encoder dan OneHotEncoder

from sklearn.preprocessing import LabelEncoder, OneHotEncoder

In [ ]:
label_encoder = LabelEncoder() #Masukkan Ke Object dengan nama label_encoder

# Copy untuk mengcopy isinya.
temp = df.copy()

#Merubah Kolom yang kolom ke 0, menjadi Label Numerik
temp.iloc[:, 0] = label_encoder.fit_transform(df.iloc[:, 0])
print(lable_encoder.classes_)


# temp.iloc[:, 3] = label_encoder.fit_transform(df.iloc[:, 3])
# print(lable_encoder.classes_)
# print(temp)